[
    {
        "Headline": "Taiwan raises concerns about situation 'getting out of hand' with China drills",
        "Timestamp": "Reuters / Sep 23, 2023, 08:12 (IST)",
        "Description": "Taiwan's defence minister expressed concern over the increased military activities by China near the island, warning of the risk of accidental clashes. Taiwan reported the presence of dozens of Chinese fighters, drones, bombers, warships, and the carrier Shandong in the past two weeks. China has been conducting such drills to assert its sovereignty claims and pressure Taiwan.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/taiwan-raises-concerns-about-situation-getting-out-of-hand-with-china-drills/articleshow/103879018.cms",
        "Img": "https://static.toiimg.com/thumb/imgsize-123456,msid-103879018,width-300,resizemode-4/103879018.jpg"
    },
    {
        "Headline": "Russian strikes in Ukraine's city of Odesa damage port, grain silo and an abandoned hotel",
        "Timestamp": "AP / Sep 25, 2023, 19:56 (IST)",
        "Description": "A Russian drone and missile strike near Odesa damaged infrastructure, a grain silo and an abandoned hotel and injured one person in the Black Sea port city as attacks elsewhere in Ukraine killed five civilians and wounded 13 in the past day, Ukrainian officials said Monday.",
        "Link": "https://timesofindia.indiatimes.com/world/europe/russian-strikes-in-ukraines-city-of-odesa-damage-port-grain-silo-and-an-abandoned-hotel/articleshow/103937751.cms",
        "Img": "https://static.toiimg.com/thumb/imgsize-123456,msid-103937751,width-300,resizemode-4/103937751.jpg"
    },
    {
        "Headline": "Death of labourers at BRO project sites: Govt to bear expenses for transportation of mortal remains",
        "Timestamp": "PTI / Sep 24, 2023, 16:51 (IST)",
        "Description": "The Indian government will now bear the expenses for transporting the mortal remains of casual labourers who die while working for the Border Roads Organisation (BRO). Previously, this facility was only available for General Reserve Engineer Force (GREF) personnel of the BRO.",
        "Link": "https://timesofindia.indiatimes.com/india/death-of-labourers-at-bro-project-sites-govt-to-bear-expenses-for-transportation-of-mortal-remains/articleshow/103908577.cms",
        "Img": "https://static.toiimg.com/thumb/imgsize-123456,msid-103908577,width-300,resizemode-4/103908577.jpg"
    },
    {
        "Headline": "Russia says Armenian separatists surrender arms after Azerbaijan reclaims Nagorno-Karabakh",
        "Timestamp": "AP / Sep 23, 2023, 12:10 (IST)",
        "Description": "Ethnic Armenian separatists in Nagorno-Karabakh have surrendered arms to Russian peacekeepers, following Azerbaijan's reclaiming of the breakaway region. The separatist groups handed over armored vehicles, small arms, and ammunition. Talks on reintegrating the region into Azerbaijan are ongoing, while Russia is investigating two ceasefire violations.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/russia-says-armenian-separatists-surrender-arms-after-azerbaijan-reclaims-nagorno-karabakh/articleshow/103883887.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "One killed as Ukraine strikes Black Sea navy HQ with missiles",
        "Timestamp": "Reuters / Sep 22, 2023, 17:35 (IST)",
        "Description": "",
        "Link": "https://timesofindia.indiatimes.com/world/europe/one-killed-as-ukraine-strikes-black-sea-navy-hq-with-missiles/articleshow/103867234.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "defence ministry clears proposal to buy 'Pralay' ballistic missiles for Indian Army",
        "Timestamp": "ANI / Sep 17, 2023, 19:29 (IST)",
        "Description": "In a major boost to its firepower, the defence ministry has approved the procurement of a regiment of 'Pralay' ballistic missiles for the Indian Army for deployment along the Line of Actual Control (LAC) and Line of Control (LoC), that is, borders with China and Pakistan respectively.",
        "Link": "https://timesofindia.indiatimes.com/india/defence-ministry-clears-proposal-to-buy-pralay-ballistic-missiles-for-indian-army/articleshow/103736303.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Bulgaria sends team to inspect drone that landed in Black Sea resort",
        "Timestamp": "Reuters / Sep 18, 2023, 20:04 (IST)",
        "Description": "Bulgaria's defense ministry has sent a special unit to inspect and deactivate a drone carrying explosives that landed in the Black Sea town of Tyulenovo. The team will decide how to dispose of it after inspection. The defense minister suggested the drone is related to the war between Russia and Ukraine. The origin of the drone and how it reached Bulgaria is unknown. Last week, fragments of a suspected drone were found in Romania after an attack on Ukraine's Danube ports.",
        "Link": "https://timesofindia.indiatimes.com/world/europe/bulgaria-sends-team-to-inspect-drone-that-landed-in-black-sea-resort/articleshow/103762696.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Bulgaria sends team to inspect drone that landed in Black Sea resort",
        "Timestamp": "Reuters / Sep 18, 2023, 14:31 (IST)",
        "Description": "Bulgaria's defense ministry said on Monday that it had dispatched a special unit to investigate and disable a drone carrying explosives that had landed near the Black Sea town of Tyulenovo on Sunday evening. Following the examination, a team from NATO member Bulgaria will decide how to dispose of it, according to the ministry, which added that the team was sent at the request of the regional administration.",
        "Link": "https://timesofindia.indiatimes.com/world/europe/bulgaria-sends-team-to-inspect-drone-that-landed-in-black-sea-resort/articleshow/103753768.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Taiwan urges China to stop 'destructive' military activities",
        "Timestamp": "Reuters / Sep 18, 2023, 10:42 (IST)",
        "Description": "Taiwan's defense ministry has called on China to stop its \"destructive, unilateral action\" after reporting an increase in Chinese military activities near the island. The ministry stated that it had spotted 103 Chinese military aircraft over the sea, with some crossing the unofficial barrier in the Taiwan Strait. China's actions have caused \"serious challenges\" to regional security and could lead to a sharp increase in tensions, according to the ministry.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/update-3-taiwan-urges-china-to-stop-destructive-military-activities/articleshow/103746826.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Centre gives preliminary nod to projects worth Rs 45,000 crore, including 12 Sukhoi-30MKI fighters",
        "Timestamp": "TIMESOFINDIA.COM / Sep 15, 2023, 16:51 (IST)",
        "Description": "The defence acquisition council on Friday approved nine procurement proposals worth around Rs 45,000 crore, including ones to acquire 12 Su-30 MKI fighter jets as well as Dhruvastra air-to-surface missiles and upgrade of Dornier aircraft.The 12 Su-30MKIs for the Indian Air Force would be manufactured in India by Hindustan Aeronautics Limited.",
        "Link": "https://timesofindia.indiatimes.com/india/centre-gives-preliminary-nod-for-projects-worth-rs-45000-crore-including-12-sukhoi-30mki-fighters/articleshow/103691783.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Taiwan says Chinese carrier group in Western Pacific for training",
        "Timestamp": "Reuters / Sep 11, 2023, 08:33 (IST)",
        "Description": "A Chinese naval formation led by the aircraft carrier Shandong passed 60 nautical miles (111km) to Taiwan's southeast on Monday and entered the western Pacific for training, the island's defence ministry said.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/taiwan-says-chinese-carrier-group-in-western-pacific-for-training/articleshow/103564969.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Indonesia, Boeing sign deal for sale of F-15 fighter jets",
        "Timestamp": "Reuters / Aug 22, 2023, 08:51 (IST)",
        "Description": "The memorandum of understanding was signed on Monday at Boeing's St. Louis, Missouri, facility by representatives from the ministry. Boeing stressed that the deal was still pending U.S. government approval. \"This state-of-the-art fighter will protect and secure our nation with its advanced capabilities,\" Indonesian Defence Minister Prabowo Subianto said, according to Boeing's statement.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/indonesia-boeing-sign-deal-for-sale-of-f-15-fighter-jets/articleshow/102925177.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Drones targeted 5 regions in biggest attack on Russian soil in 18 months, defense ministry says",
        "Timestamp": "AP / Aug 30, 2023, 07:11 (IST)",
        "Description": "",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/drones-targeted-5-regions-in-biggest-attack-on-russian-soil-in-18-months-defense-ministry-says/articleshow/103189358.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Gotabaya denies bombings staged to enable his election",
        "Timestamp": "AP / Sep 08, 2023, 07:24 (IST)",
        "Description": "Former Sri Lankan President Gotabaya Rajapaksa on Thursday denied allegations in a British TV programme that IS-inspired extremists were used to carry out suicide bomb attacks in 2019 to create insecurity in the country and help him win election later that year. Rajapaksa said in his statement that he did not have any contact with the intelligence officer named in the documentary from the time he resigned as defence ministry secretary in 2015 until he became president in 2019.",
        "Link": "https://timesofindia.indiatimes.com/world/south-asia/gotabaya-denies-bombings-staged-to-enable-his-election/articleshow/103485631.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "MoD drops merger plans for Dehu Road Cantt civil areas",
        "Timestamp": "TNN / Sep 07, 2023, 08:50 (IST)",
        "Description": "he defence ministry has decided to back the move to exclude civilian areas in Dehu Road Cantonment for merger with a neighbouring municipal corporation. It follows serious security concerns raised by Dehu Road Military Station, the local military authority.",
        "Link": "https://timesofindia.indiatimes.com/city/pune/mod-drops-merger-plans-for-dehu-road-cantt-civil-areas/articleshow/103450823.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Russia says it downed Ukraine-launched drones targeting Moscow",
        "Timestamp": "Reuters / Sep 05, 2023, 09:58 (IST)",
        "Description": "Russia's defence ministry announced that it shot down three drones launched by Ukraine, targeting Moscow. The air defence systems destroyed two drones near the Moscow region and one over the Istra district. The mayor of Moscow confirmed that the drones were attempting to attack the city and caused damage to a consumer services facility.",
        "Link": "https://timesofindia.indiatimes.com/world/europe/russia-says-it-downed-ukraine-launched-drones-targeting-moscow/articleshow/103377610.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Approach road from CME gate gets nod",
        "Timestamp": "Sep 01, 2023, 09:04 (IST)",
        "Description": "",
        "Link": "https://timesofindia.indiatimes.com/city/pune/approach-road-from-cme-gate-gets-nod/articleshow/103265315.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "Japan makes record defence spending request amid tension with China",
        "Timestamp": "Reuters / Aug 31, 2023, 10:23 (IST)",
        "Description": "Japan's defence ministry has requested a record spending of 7.7 trillion yen ($52.67 billion) for fiscal 2024, as part of Prime Minister Fumio Kishida's plan to double defence spending to 2% of GDP by 2027. The budget includes funds for new weapons and resources to strengthen logistics capabilities. Japan will also collaborate with the US, Britain, and Italy to develop next-generation fighter jets.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/japan-makes-record-defence-spending-request-amid-tension-with-china/articleshow/103232561.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "North Korea launches a suspected ballistic missile into sea",
        "Timestamp": "Reuters / Aug 30, 2023, 20:50 (IST)",
        "Description": "On Wednesday, North Korea launched an alleged ballistic missile, as reported by Japan's defense ministry and South Korea's military. This action occurred just hours after the United States independently deployed B-1B bombers for joint aerial exercises with allies.",
        "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/north-korea-launches-a-suspected-ballistic-missile-into-sea/articleshow/103219593.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    },
    {
        "Headline": "defence ministry clears proposal to buy 'Pralay' ballistic missiles for Army: All you need to know",
        "Timestamp": "TIMESOFINDIA.COM / Sep 17, 2023, 19:45 (IST)",
        "Description": "India's defense ministry has approved the acquisition of a regiment of 'Pralay' ballistic missiles to be deployed along the Line of Actual Control and the Line of Control. The decision, made during a recent meeting of the Defence Acquisition Council, aims to strengthen the Army's military capabilities. 'Pralay' will be the Army's longest-range surface-to-surface missile and will form part of India's Rocket Force, along with the BrahMos supersonic cruise missile.",
        "Link": "https://timesofindia.indiatimes.com/india/defence-ministry-clears-proposal-to-buy-pralay-ballistic-missiles-for-army-all-you-need-to-know/articleshow/103736331.cms",
        "Img": "https://static.toiimg.com/photo/25581306.cms"
    }
]